; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_10_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 - counter
	)
  (:init
		(= (value c0) 20)
	(= (value c1) 47)
	(= (value c2) 55)
	(= (value c3) 11)
	(= (value c4) 20)
	(= (value c5) 41)
	(= (value c6) 81)
	(= (value c7) 75)
	(= (value c8) 10)
	(= (value c9) 32)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
		)
	)
)

; plan
1. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 6 of 9
2. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 6 of 9
3. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 6 of 9
4. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 6 of 9
5. (decrement c6)
   changed: (value c6) from 81 to 77
   goals met: 6 of 9
6. (decrement c6)
   changed: (value c6) from 77 to 73
   goals met: 7 of 9
7. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 9
8. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 7 of 9
9. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 7 of 9
10. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 7 of 9
11. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 9
12. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 7 of 9
13. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 7 of 9
14. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 7 of 9
15. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 7 of 9
16. (increment c8)
   changed: (value c8) from 10 to 19
   goals met: 7 of 9
17. (increment c8)
   changed: (value c8) from 19 to 28
   goals met: 7 of 9
18. (increment c8)
   changed: (value c8) from 28 to 37
   goals met: 6 of 9
19. (increment c8)
   changed: (value c8) from 37 to 46
   goals met: 6 of 9
20. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 6 of 9
21. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 6 of 9
22. (decrement c8)
   changed: (value c8) from 46 to 37
   goals met: 6 of 9
23. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 6 of 9
24. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 6 of 9
25. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 6 of 9
26. (increment c8)
   changed: (value c8) from 37 to 47
   goals met: 6 of 9
27. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 6 of 9
28. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 6 of 9
29. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 6 of 9
30. (increment c9)
   changed: (value c9) from 32 to 35
   goals met: 6 of 9
31. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 6 of 9
32. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 6 of 9
33. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 6 of 9
34. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 6 of 9
35. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 6 of 9
36. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 6 of 9
37. (increment c3)
   changed: (value c3) from 11 to 17
   goals met: 6 of 9
38. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 6 of 9
39. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 6 of 9
40. (increment c3)
   changed: (value c3) from 17 to 25
   goals met: 5 of 9
41. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 5 of 9
42. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 5 of 9
43. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 5 of 9
44. (increment c3)
   changed: (value c3) from 25 to 34
   goals met: 5 of 9
45. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 5 of 9
46. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 5 of 9
47. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 5 of 9
48. (increment c3)
   changed: (value c3) from 34 to 44
   goals met: 5 of 9
49. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 5 of 9
50. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 5 of 9
51. (decrement c7)
   changed: (value c7) from 75 to 69
   goals met: 4 of 9
52. (decrement c7)
   changed: (value c7) from 69 to 63
   goals met: 4 of 9
53. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 4 of 9
54. (decrement c6)
   changed: (value c6) from 73 to 69
   goals met: 4 of 9
55. (decrement c6)
   changed: (value c6) from 69 to 65
   goals met: 4 of 9
56. (decrement c6)
   changed: (value c6) from 65 to 61
   goals met: 5 of 9
57. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 5 of 9
58. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 5 of 9
59. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 5 of 9
60. (increment c4)
   changed: (value c4) from 20 to 25
   goals met: 5 of 9
61. (increment c4)
   changed: (value c4) from 25 to 30
   goals met: 5 of 9
62. (increment c4)
   changed: (value c4) from 30 to 35
   goals met: 5 of 9
63. (increment c4)
   changed: (value c4) from 35 to 40
   goals met: 5 of 9
64. (increment c4)
   changed: (value c4) from 40 to 45
   goals met: 5 of 9
65. (increment c3)
   changed: (value c3) from 44 to 54
   goals met: 4 of 9
66. (decrement c4)
   changed: (value c4) from 45 to 40
   goals met: 5 of 9
67. (decrement c2)
   changed: (value c2) from 55 to 53
   goals met: 6 of 9
68. (increment c9)
   changed: (value c9) from 35 to 38
   goals met: 6 of 9
69. (increment c9)
   changed: (value c9) from 38 to 41
   goals met: 6 of 9
70. (increment c9)
   changed: (value c9) from 41 to 44
   goals met: 6 of 9
71. (increment c9)
   changed: (value c9) from 44 to 47
   goals met: 6 of 9
72. (increment c9)
   changed: (value c9) from 47 to 50
   goals met: 7 of 9
73. (increment c8)
   changed: (value c8) from 47 to 57
   goals met: 6 of 9
74. (increment c9)
   changed: (value c9) from 50 to 53
   goals met: 6 of 9
75. (increment c9)
   changed: (value c9) from 53 to 56
   goals met: 6 of 9
76. (increment c9)
   changed: (value c9) from 56 to 59
   goals met: 7 of 9
77. (decrement c7)
   changed: (value c7) from 63 to 56
   goals met: 7 of 9
78. (decrement c6)
   changed: (value c6) from 61 to 57
   goals met: 7 of 9
79. (decrement c6)
   changed: (value c6) from 57 to 53
   goals met: 8 of 9
80. (increment c4)
   changed: (value c4) from 40 to 45
   goals met: 7 of 9
81. (decrement c3)
   changed: (value c3) from 54 to 44
   goals met: 7 of 9
82. (decrement c2)
   changed: (value c2) from 53 to 51
   goals met: 7 of 9
83. (decrement c2)
   changed: (value c2) from 51 to 49
   goals met: 7 of 9
84. (decrement c2)
   changed: (value c2) from 49 to 47
   goals met: 6 of 9
85. (decrement c2)
   changed: (value c2) from 47 to 45
   goals met: 6 of 9
86. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 6 of 9
87. (decrement c2)
   changed: (value c2) from 45 to 43
   goals met: 7 of 9
88. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 7 of 9
89. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 7 of 9
90. (decrement c1)
   changed: (value c1) from 47 to 44
   goals met: 7 of 9
91. (decrement c1)
   changed: (value c1) from 44 to 41
   goals met: 8 of 9
92. (decrement c4)
   changed: (value c4) from 45 to 40
   goals met: 8 of 9
93. (decrement c3)
   changed: (value c3) from 44 to 34
   goals met: 8 of 9
94. (decrement c2)
   changed: (value c2) from 43 to 41
   goals met: 7 of 9
95. (decrement c2)
   changed: (value c2) from 41 to 39
   goals met: 7 of 9
96. (decrement c2)
   changed: (value c2) from 39 to 37
   goals met: 7 of 9
97. (decrement c2)
   changed: (value c2) from 37 to 35
   goals met: 7 of 9
98. (decrement c2)
   changed: (value c2) from 35 to 33
   goals met: 8 of 9
99. (decrement c1)
   changed: (value c1) from 41 to 38
   goals met: 8 of 9
100. (decrement c1)
   changed: (value c1) from 38 to 35
   goals met: 8 of 9
101. (decrement c1)
   changed: (value c1) from 35 to 32
   goals met: 9 of 9
